Examples/other/angledDuctImplicit/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// block definition for a porosity with an angled inlet/outlet
// the porosity is not aligned with the main axes
//
                             
convertToMeters 0.001;

vertices
(
    // inlet region
    ( -150  0  -25 )  // pt 0 (in1b) 
    ( -150 35.35533906  -25 ) // pt 1 (in2b) 
    ( -150  0  25 )  // pt 2 (in1f) 
    ( -150 35.35533906  25 ) // pt 3 (in2f) 

    // join inlet->outlet
    (  0 0  -25 )    // pt 4 (join1b) 
    ( -35.35533906   35.35533906  -25 ) // pt 5 (join2b) 
    (  0 0  25 )    // pt 6 (join1f) 
    ( -35.35533906   35.35533906  25 ) // pt 7 (join2f) 

    // porosity ends ->outlet
    ( 70.71067812 70.71067812  -25 )  // pt 8 (poro1b) 
    ( 35.35533906 106.06601718  -25 )  // pt 9 (poro2b) 
    ( 70.71067812 70.71067812  25 )  // pt 10 (poro1f) 
    ( 35.35533906 106.06601718  25 )  // pt 11 (poro2f) 

    // outlet
    ( 141.42135624 141.42135624 -25 ) // pt 12 (out1b) 
    ( 106.06601718 176.7766953 -25 ) // pt 13 (out2b) 
    ( 141.42135624 141.42135624 25 ) // pt 14 (out1f) 
    ( 106.06601718 176.7766953 25 ) // pt 15 (out2f) 
);

blocks
(
    // inlet block
    hex (0 4 5 1 2 6 7 3)
    inlet ( 15 20 20 ) simpleGrading (1 1 1)

    // porosity block
    hex (4 8 9 5 6 10 11 7)
    porosity ( 20 20 20 ) simpleGrading (1 1 1)

    // outlet block
    hex (8 12 13 9 10 14 15 11)
    outlet ( 20 20 20 )  simpleGrading (1 1 1)
);

edges
(
);

patches
(
    // is there no way of defining all my 'defaultFaces' to be 'wall'?
    wall front
    (
    // inlet block
    (2 6 7 3)
    // outlet block
    (10 14 15 11)
    )

    wall back
    (
    // inlet block
    (1 5 4 0)
    // outlet block
    (9 13 12 8)
    )

    wall wall
    (
    // inlet block
    (2 0 4 6)
    (7 5 1 3)
    // outlet block
    (10 8 12 14)
    (15 13 9 11)
    )

    wall porosityWall
    (
    // porosity block
    (6 10 11 7)
    // porosity block
    (5 9 8 4)
    // porosity block
    (6 4 8 10)
    (11 9 5 7)
    )

    patch inlet
    (
    (3 1 0 2)
    )

    patch outlet
    (
    (15 13 12 14)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
